hasebems/PIC18F14K50_MagicFlute/i2cdevice.c
/*
 * File:   i2cdevice.c
 * Author: M.Hasebe
 *
 * Created on 2014/12/14
 */

#include <stdio.h>
#include <stdlib.h>
#include <stdbool.h>
#include <xc.h>

//-------------------------------------------------------------------------
//			I2C Basic Functions
//-------------------------------------------------------------------------
//#ifndef _XTAL_FREQ
    /* 例：4MHzの場合、4000000 をセットする */
//    #define _XTAL_FREQ 48000000
//#endif

//extern bool	dbg;
#define	LED2         PORTCbits.RC5

// I2C通信がビジー状態を脱するまで待つ
bool i2c_wait(void){
	volatile int cnt=0;
    while ( ( SSPCON2 & 0x1F ) || ( SSPSTAT & 0x04 ) ){
		if ( cnt++ > 1000 ) return false;
	}
	return true;
}

// I2Cバスを有効化
void i2c_enable(void)
{
    SSPSTAT = 0b00000000;      // I2C 100kHz
    SSPADD = 0x1d;             // I2Cbus Baud rate,  48MHz/((SSP1ADD + 1)*4) = 100kHz
    SSPCON1 = 0b00101000;      // I2C enable, Master Mode
	SSPCON2 = 0x00;
}

// I2Cバスを無効化
void i2c_disable(void){
    SSPCON1 = 0b00001000;      // I2C disable, Master Mode
}

// I2C書き込みサイクルの開始（Start Conditionの発行）
void i2c_start(void){
    SSPCON2bits.SEN = 1;       //  Start Condition Enabled bit
    i2c_wait();
}

// I2C書き込みサイクルの開始（Repeat Start Conditionの発行）
void i2c_repeat_start(void){
    SSPCON2bits.RSEN = 1;      //  Start Condition Enabled bit
    i2c_wait();
}

// I2C書き込みサイクルの終了（Stop Conditionの発行）
void i2c_stop(void){
    SSPCON2bits.PEN = 1;       // Stop Condition Enable bit
    i2c_wait();
}

// I2Cバスにデータを送信（1バイト分）
bool i2c_send_byte(const unsigned char data){
    SSPBUF = data;
    return i2c_wait();
}

//I2Cバスからデータ受信
// ack=1 : 受信後ACKを送信し、次のデータを送るようスレーブデバイスに指示
// ack=0 : 受信後NO_ACKを送信し、これ以上受信しないことをスレーブデバイスに指示
unsigned char i2c_read_byte(const char ack){
    SSPCON2bits.RCEN = 1;
    i2c_wait();
    unsigned char data = SSPBUF;
    if ( i2c_wait() == false ) return data;

    if(ack) SSPCON2bits.ACKDT = 0;     // ACK
    else SSPCON2bits.ACKDT = 1;        // NO_ACK

    SSPCON2bits.ACKEN = 1;

    i2c_wait();
    return data;
}

//-------------------------------------------------------------------------
//			Constants
//-------------------------------------------------------------------------
//static unsigned char GPIO_EXPANDER_ADDRESS = 0x3e;
static unsigned char PRESSURE_SENSOR_ADDRESS = 0x5d;
static unsigned char TOUCH_SENSOR_ADDRESS = 0x5a;
static unsigned char LED_BLINKM_ADDRESS = 0x09;
//static unsigned char ADC_ADDRESS = 0x48;
//static unsigned char LED_ADA88_ADDRESS = 0x70;
static unsigned char ACCEL_SENSOR_ADDRESS = 0x1d;

// I2C Bus Control Definition
#define I2C_WRITE_CMD 0
#define I2C_READ_CMD 1
//-------------------------------------------------------------------------
//			I2c Device Access Functions
//-------------------------------------------------------------------------
void initI2c( void )
{
	i2c_enable();
}
//-------------------------------------------------------------------------
void quitI2c( void )
{
	i2c_disable();
}
//-------------------------------------------------------------------------
void writeI2c( unsigned char adrs, unsigned char data )
{
	i2c_start();
	if ( i2c_send_byte((adrs<<1) | I2C_WRITE_CMD) == false ) return;   // アドレスを1ビット左にシフトし、末尾にR/Wビット（Write=0）を付与
	if ( i2c_send_byte(data) == false ) return;
	i2c_stop();
}
//-------------------------------------------------------------------------
void writeI2cWithCmd( unsigned char adrs, unsigned char cmd, unsigned char data )
{
	i2c_start();
	if ( i2c_send_byte((adrs<<1) | I2C_WRITE_CMD) == false ) return;   // アドレスを1ビット左にシフトし、末尾にR/Wビット（Write=0）を付与
	if ( i2c_send_byte(cmd) == false ) return;
	if ( i2c_send_byte(data) == false ) return;
	i2c_stop();
}
//-------------------------------------------------------------------------
void writeI2cWithCmdAndMultiData( unsigned char adrs, unsigned char cmd, unsigned char* data, int length )
{
	int i=0;
	i2c_start();
	if ( i2c_send_byte((adrs<<1) | I2C_WRITE_CMD) == false ) return;   // アドレスを1ビット左にシフトし、末尾にR/Wビット（Write=0）を付与
	if ( i2c_send_byte(cmd) == false ) return;
	while (i<length){
		if ( i2c_send_byte(*(data+i)) == false ) return;
		i++;
	}
	i2c_stop();
}
//-------------------------------------------------------------------------
void readI2c( unsigned char adrs, unsigned char* data )
{
	i2c_start();
	if ( i2c_send_byte((adrs<<1) | I2C_READ_CMD) == false ) return;   // アドレスを1ビット左にシフトし、末尾にR/Wビット（Read=0）を付与
	*data = i2c_read_byte(0);
	i2c_stop();
}
//-------------------------------------------------------------------------
void readI2cWithCmd( unsigned char adrs, unsigned char cmd, unsigned char* data, int length )
{
	int i=0;
	i2c_start();
	if ( i2c_send_byte((adrs<<1) | I2C_WRITE_CMD) == false ) return;   // アドレスを1ビット左にシフトし、末尾にR/Wビット（Write=0）を付与
	if ( i2c_send_byte(cmd) == false ) return;

	i2c_repeat_start();
	if ( i2c_send_byte((adrs<<1) | I2C_READ_CMD) == false ) return;   // アドレスを1ビット左にシフトし、末尾にR/Wビット（Read=0）を付与
	while (i<length){
		if ( length > i+1 ){
			*(data+i) = i2c_read_byte(1);
		}
		else {	//	Final
			*(data+i) = i2c_read_byte(0);
		}
		i++;
	}
	i2c_stop();
}

//-------------------------------------------------------------------------
//			LPS331AP (Pressure Sencer : I2c Device)
//-------------------------------------------------------------------------
//	for Pressure Sencer
#define		PRES_SNCR_RESOLUTION		0x10
#define		PRES_SNCR_PWRON				0x20
#define		PRES_SNCR_START				0x21
#define		PRES_SNCR_ONE_SHOT			0x01
#define		PRES_SNCR_RCV_DT_FLG		0x27
#define		PRES_SNCR_RCV_TMPR			0x01
#define		PRES_SNCR_RCV_PRES			0x02
#define		PRES_SNCR_DT_L				0x28
#define		PRES_SNCR_DT_M				0x29
#define		PRES_SNCR_DT_H				0x2a
//-------------------------------------------------------------------------
void LPS331AP_init( void )
{
	//	Init Parameter
	writeI2cWithCmd( PRESSURE_SENSOR_ADDRESS, PRES_SNCR_RESOLUTION, 0x6A );	//	Resolution
	writeI2cWithCmd( PRESSURE_SENSOR_ADDRESS, PRES_SNCR_PWRON, 0xf0 );	//	Power On
}
//-------------------------------------------------------------------------
int LPS331AP_getPressure( void )
{
	unsigned char	dt[3];
	float	tmpPrs = 0;

	readI2cWithCmd( PRESSURE_SENSOR_ADDRESS, PRES_SNCR_DT_L|0x80, dt, 3 );
	tmpPrs = (float)(((unsigned long)dt[2]<<16)|((unsigned long)dt[1]<<8)|dt[0]);
	tmpPrs = tmpPrs*10/4096;

	return (int)tmpPrs;
}

//-------------------------------------------------------------------------
//			MPR121 (Touch Sencer : I2c Device)
//-------------------------------------------------------------------------
//	for Touch Sencer
#define		TCH_SNCR_TOUCH_STATUS1		0x00
#define		TCH_SNCR_TOUCH_STATUS2		0x01
#define 	TCH_SNCR_ELE_CFG			0x5e
#define 	TCH_SNCR_MHD_R				0x2b
#define 	TCH_SNCR_MHD_F				0x2f
#define 	TCH_SNCR_ELE0_T				0x41
#define 	TCH_SNCR_FIL_CFG			0x5d
#define 	TCH_SNCR_MHDPROXR			0x36
#define 	TCH_SNCR_EPROXTTH			0x59

// Threshold defaults
#define		E_THR_T      0x02	// Electrode touch threshold
#define		E_THR_R      0x01	// Electrode release threshold
#define		PROX_THR_T   0x02	// Prox touch threshold
#define		PROX_THR_R   0x02	// Prox release threshold
//-------------------------------------------------------------------------
void MPR121_init( void )
{
	int	i, j;

	//	Init Parameter
	// Put the MPR into setup mode
	writeI2cWithCmd( TOUCH_SENSOR_ADDRESS, TCH_SNCR_ELE_CFG, 0x00 );

    // Electrode filters for when data is > baseline
    unsigned char gtBaseline[] = {
		0x01,  //MHD_R
		0x01,  //NHD_R
		0x00,  //NCL_R
		0x00   //FDL_R
	};
	for ( i=0; i<4; i++ )
		writeI2cWithCmd( TOUCH_SENSOR_ADDRESS, TCH_SNCR_MHD_R+i, gtBaseline[i] );


	// Electrode filters for when data is < baseline
	unsigned char ltBaseline[] = {
        0x01,   //MHD_F
        0x01,   //NHD_F
        0xFF,   //NCL_F
        0x02    //FDL_F
	};
	for ( i=0; i<4; i++ )
		writeI2cWithCmd( TOUCH_SENSOR_ADDRESS, TCH_SNCR_MHD_F+i, ltBaseline[i] );

    // Electrode touch and release thresholds
    unsigned char electrodeThresholds[] = {
        E_THR_T, // Touch Threshhold
        E_THR_R  // Release Threshold
	};

    for( j=0; j<12; j++ ){
		for ( i=0; i<2; i++ ){
			writeI2cWithCmd( TOUCH_SENSOR_ADDRESS, TCH_SNCR_ELE0_T+(j*2)+i, electrodeThresholds[i] );
    	}
	}

    // Proximity Settings
    unsigned char proximitySettings[] = {
        0xff,   //MHD_Prox_R
        0xff,   //NHD_Prox_R
        0x00,   //NCL_Prox_R
        0x00,   //FDL_Prox_R
        0x01,   //MHD_Prox_F
        0x01,   //NHD_Prox_F
        0xff,   //NCL_Prox_F
        0xff,   //FDL_Prox_F
        0x00,   //NHD_Prox_T
        0x00,   //NCL_Prox_T
        0x00    //NFD_Prox_T
	};
    for ( i=0; i<11; i++ )
		writeI2cWithCmd( TOUCH_SENSOR_ADDRESS, TCH_SNCR_MHDPROXR+i, proximitySettings[i] );

    unsigned char proxThresh[] = {
        PROX_THR_T, // Touch Threshold
        PROX_THR_R  // Release Threshold
	};
    for ( i=0; i<2; i++ )
		writeI2cWithCmd( TOUCH_SENSOR_ADDRESS, TCH_SNCR_EPROXTTH+i, proxThresh[i] );

	writeI2cWithCmd( TOUCH_SENSOR_ADDRESS, TCH_SNCR_FIL_CFG, 0x04 );

    // Set the electrode config to transition to active mode
	writeI2cWithCmd( TOUCH_SENSOR_ADDRESS, TCH_SNCR_ELE_CFG, 0x0c );
}
//-------------------------------------------------------------------------
unsigned char MPR121_getTchSwData( void )
{
	unsigned char buf[2];

	readI2cWithCmd( TOUCH_SENSOR_ADDRESS, TCH_SNCR_TOUCH_STATUS1, buf, 1 );

//	return (buf[1]<<8) | buf[0];
	return buf[0];
}

//-------------------------------------------------------------------------
//			ADXL345 (Acceleration Sencer : I2c Device)
//-------------------------------------------------------------------------
//	for Acceleration Sencer
#define ACCEL_SNCR_PWR_CTRL			0x2d
#define ACCEL_SNCR_DATA_FORMAT		0x31
//-------------------------------------------------------------------------
void ADXL345_init( void )
{
	//	Start Access
	writeI2cWithCmd(ACCEL_SENSOR_ADDRESS,ACCEL_SNCR_PWR_CTRL,0x08);			//	Start Measurement
	writeI2cWithCmd(ACCEL_SENSOR_ADDRESS,ACCEL_SNCR_DATA_FORMAT,0x04);		//	Left Justified
}
//-------------------------------------------------------------------------
void ADXL345_getAccel( signed short* value )
{
	unsigned short tmp;
	unsigned char reg[2];

	readI2cWithCmd(ACCEL_SENSOR_ADDRESS,0x32,reg,2);
	tmp = reg[0];
	tmp |= reg[1] << 8;
	*value = (signed short)tmp;

	readI2cWithCmd(ACCEL_SENSOR_ADDRESS,0x34,reg,2);
	tmp = reg[0];
	tmp |= reg[1] << 8;
	*(value+1) = (signed short)tmp;

	readI2cWithCmd(ACCEL_SENSOR_ADDRESS,0x36,reg,2);
	tmp = reg[0];
	tmp |= reg[1] << 8;
	*(value+2) = (signed short)tmp;
}

//-------------------------------------------------------------------------
//			BlinkM ( Full Color LED : I2c Device)
//-------------------------------------------------------------------------
void BlinkM_init( void )
{
	unsigned char color[3] = {0x00,0x00,0x00};
	writeI2cWithCmd( LED_BLINKM_ADDRESS, 'o', 0 );
	writeI2cWithCmd( LED_BLINKM_ADDRESS, 'f', 80 );
	writeI2cWithCmdAndMultiData( LED_BLINKM_ADDRESS, 'n', color, 3 );
}
//-------------------------------------------------------------------------
const unsigned char tNoteToColor[13][3] = {
	//	R	  G		B
	{ 0xff, 0x00, 0x00 },
	{ 0xe0, 0x20, 0x00 },
	{ 0xc0, 0x40, 0x00 },
	{ 0xa0, 0x60, 0x00 },
	{ 0x80, 0x80, 0x00 },
	{ 0x00, 0xff, 0x00 },
	{ 0x00, 0x80, 0x80 },
	{ 0x00, 0x00, 0xff },
	{ 0x20, 0x00, 0xe0 },
	{ 0x40, 0x00, 0xc0 },
	{ 0x60, 0x00, 0xa0 },
	{ 0x80, 0x00, 0x80 },
	{ 0x00, 0x00, 0x00 }
};
//-------------------------------------------------------------------------
void BlinkM_changeColor( unsigned char note )
{
	writeI2cWithCmdAndMultiData( LED_BLINKM_ADDRESS, 'c', (unsigned char*)tNoteToColor[note], 3 );
}
